JEB12345/dwm1000_dspic/decadriver/deca_device.c
/*! ----------------------------------------------------------------------------
 *  @file    deca_device.c
 *  @brief   DecaWave device control functions
 *
 * @attention
 *
 * Copyright 2013 (c) DecaWave Ltd, Dublin, Ireland.
 *
 * All rights reserved.
 *
 * @author DecaWave
 */
#include "deca_types.h"
#include "deca_param_types.h"
#include "deca_regs.h"
#include "deca_device_api.h"
#include "../dwm_spi.h"
#include <stddef.h>
#include <xc.h>

#define Sleep(x) Delay_us(x)

// Defines for enable_clocks function
#define FORCE_SYS_XTI  0
#define ENABLE_ALL_SEQ 1
#define FORCE_SYS_PLL  2
#define READ_ACC_ON    7
#define READ_ACC_OFF   8
#define FORCE_OTP_ON   11
#define FORCE_OTP_OFF  12
#define FORCE_TX_PLL   13

// #define DWT_API_ERROR_CHECK     // define so API checks config input parameters

// -------------------------------------------------------------------------------------------------------------------
//
// Internal functions for controlling and configuring the device
//
// -------------------------------------------------------------------------------------------------------------------

// Enable and Configure specified clocks
void _dwt_enableclocks(int clocks) ;
// Configure the ucode (FP algorithm) parameters
void _dwt_configlde(int prf);
// load ucode from OTP/ROM
int _dwt_loaducodefromrom(void);
//read non-volatile memory
uint32_t _dwt_otpread(uint32_t address);
//program the non-volatile memory
uint32_t _dwt_otpprogword32(uint32_t data, uint16_t address);
//upload the device configuration into always on memory
void _dwt_aonarrayupload(void);
// -------------------------------------------------------------------------------------------------------------------

/*!
 * Static data for DW1000 DecaWave Transceiver control
 */

// -------------------------------------------------------------------------------------------------------------------
// structure to hold device data
typedef struct
{
    uint32_t      deviceID ;
    uint32_t      partID ;
    uint32_t      lotID ;
    uint8_t       chan;               // added chan here - used in the reading of acc
    uint8_t       longFrames ;        // flag in non-standard long frame mode
    uint32_t      txFCTRL ;           // keep TX_FCTRL register config
    uint16_t      rfrxDly;            // rf delay (delay though the RF blocks before the signal comes out of the antenna i.e. "antenna delay")
    uint16_t      rftxDly;            // rf delay (delay though the RF blocks before the signal comes out of the antenna i.e. "antenna delay")
    uint32_t      antennaDly;         // antenna delay read from OTP 64 PRF value is in high 16 bits and 16M PRF in low 16 bits
    uint8_t       xtrim;              // xtrim value read from OTP
    uint8_t       dblbuffon;          // double rx buffer mode flag
    uint32_t      sysCFGreg ;         // local copy of system config register
    uint32_t      txPowCfg[12];       // stores the Tx power configuration read from OTP (6 channels consecutively with PRF16 then 64, e.g. Ch 1 PRF16 is index 0 and 64 index 1)
    
    dwt_callback_data_t cdata;      // callback data structure

    uint32_t      states[3] ;         //MP workaround debug states register
    uint8_t       statescount ;
    uint8_t		wait4resp ;			//wait 4 response was set with last TX start command
    int         prfIndex ;

	uint32_t		ldoTune ;			//low 32 bits of LDO tune value

    void (*dwt_txcallback)(const dwt_callback_data_t *txd);
    void (*dwt_rxcallback)(const dwt_callback_data_t *rxd);

} dwt_local_data_t ;

static dwt_local_data_t dw1000local ; // Static local device data

/*! ------------------------------------------------------------------------------------------------------------------
 * @fn dwt_initialise()
 *
 * @brief This function initiates communications with the DW1000 transceiver
 * and reads its DEV_ID register (address 0x00) to verify the IC is one supported
 * by this software (e.g. DW1000 32-bit device ID value is 0xDECA0130).  Then it
 * does any initial once only device configurations needed for use and initialises
 * as necessary any static data items belonging to this low-level driver.
 *
 * NOTES: 
 * 1.this function needs to be run before dwt_configuresleep, also the SPI freq has to be < 3MHz
 * 2.it also reads any calibration data from OTP memory as specified by the input paramter
 *
 * input parameters
 * @param config    -   specifies what configuration to load form OTP memory
 *                  DWT_LOADUCODE     0x800 - load the LDE micro-code from ROM - enabled accurate RX timestamp
 *                  DWT_LOADTXCONFIG  0x4 - load the TX power values
 *                  DWT_LOADANTDLY    0x2 - load the antenna delay values
 *                  DWT_LOADXTALTRIM  0x1 - load XTAL trim values
 *                  DWT_LOADNONE      0x0 - do not load any values from OTP memory
 *
 * output parameters
 *
 * returns DWT_DECA_SUCCESS for success, or DWT_DECA_ERROR for error
 */
//OTP addresses definitions
#define LDOTUNE_ADDRESS (0x04)
#define PARTID_ADDRESS (0x06)
#define LOTID_ADDRESS  (0x07)
#define VBAT_ADDRESS   (0x08)
#define VTEMP_ADDRESS  (0x09)
#define TXCFG_ADDRESS  (0x10)
#define ANTDLY_ADDRESS (0x1C)
#define XTRIM_ADDRESS  (0x1E)

int dwt_initialise(uint16_t config)
{
    int i = 0;

    dw1000local.statescount = 0;
    dw1000local.dblbuffon = 0; //double mode off by default
    dw1000local.prfIndex = 0; //16M
    dw1000local.cdata.aatset = 0;
	dw1000local.ldoTune = 0;
    dw1000local.wait4resp = 0;

    dw1000local.dwt_txcallback = NULL ;
    dw1000local.dwt_rxcallback = NULL ;

    dw1000local.deviceID =  dwt_readdevid() ;

    // read and validate device ID return -1 if not recognized
    if (DWT_DEVICE_ID != dw1000local.deviceID) // MP IC ONLY (i.e. DW1000) FOR THIS CODE
    {
        return DWT_ERROR ;
    }

    _dwt_enableclocks(FORCE_SYS_XTI); //NOTE: set system clock to XTI - this is necessary to make sure the values read by _dwt_otpread are reliable

	if(config & DWT_LOADLDOTUNE)
	{
		dw1000local.ldoTune = _dwt_otpread(LDOTUNE_ADDRESS);
	}

	if((dw1000local.ldoTune & 0xFF) != 0) //LDO tune values are stored in the OTP
	{
		uint8_t ldok = OTP_SF_LDO_KICK;
		//kick LDO tune
		dwt_writetodevice(OTP_IF_ID, OTP_SF, 1, &ldok); // set load LDE kick bit
	}
	else
	{
		dw1000local.ldoTune = 0;
	}

    dw1000local.partID = _dwt_otpread(PARTID_ADDRESS);

    dw1000local.lotID = _dwt_otpread(LOTID_ADDRESS);

