JEB12345/dwm1000_dspic/decadriver/deca_device.c
    if(config & DWT_LOADANTDLY)
	{
        dw1000local.antennaDly = _dwt_otpread(ANTDLY_ADDRESS);
	}
    else
	{
        dw1000local.antennaDly = 0;
	}

    if(config & DWT_LOADXTALTRIM)
    {
        dw1000local.xtrim = _dwt_otpread(XTRIM_ADDRESS) & 0x1F;

        if ( !dw1000local.xtrim )
		{
        	  dw1000local.xtrim = pll2calcfg & 0x1F ; // set to mid-range if no calibration value inside
    	}
    }
    else
    {
    	dw1000local.xtrim = pll2calcfg & 0x1F ; // set to mid-range default as described in UM 8.1.1 Calibration Method
    }

    if(config & DWT_LOADTXCONFIG)
    {
        for(i=0; i<12; i++)
        {
            dw1000local.txPowCfg[i] = _dwt_otpread(TXCFG_ADDRESS+i);
        }
    }
    else
    {
        for(i=0; i<12; i++)
        {
            dw1000local.txPowCfg[i] = 0;
        }
    }

    // load leading edge detect code
    if(config & DWT_LOADUCODE)
	{
        _dwt_loaducodefromrom();
	}
	else //should disable the LDERUN enable bit in 0x36, 0x4
	{
		uint16_t rega = dwt_read16bitoffsetreg(PMSC_ID, PMSC_CTRL1_OFFSET+1) ;
		rega &= 0xFDFF ; //clear LDERUN bit
		dwt_write16bitoffsetreg(PMSC_ID, PMSC_CTRL1_OFFSET+1, rega) ;
	}

    _dwt_enableclocks(ENABLE_ALL_SEQ); //enable clocks for sequencing

    //read system register / store local copy
    dw1000local.sysCFGreg = dwt_read32bitreg(SYS_CFG_ID) ;            // read sysconfig register

    /*{
        uint32_t reg;
        // Set up MFIO
        reg = dwt_read32bitreg(GPIO_CTRL_ID);
        //reg |= 0x00014000 ; //7 and 8 to mode - to be used with PA
		reg |= 0x00050000 ; //8 and 9 to mode - RX/TX testing
        dwt_write32bitreg(GPIO_CTRL_ID,reg);

        //disable fine grain sequencing - this is needed when using PA on the TX
        //dwt_write16bitoffsetreg(PMSC_ID,PMSC_TXFINESEQ_OFFSET,PMSC_TXFINESEQ_DIS_MASK);
    }*/

	//dwt_connect_LNA();
	
	//fix for TX/RX fast switching on B5/6 HW
    /*{
		dwt_write16bitoffsetreg(PMSC_ID, PMSC_TXFINESEQ_OFFSET, 0x03F4);
	}*/

    return DWT_SUCCESS ;

} // end dwt_initialise()

/*! ------------------------------------------------------------------------------------------------------------------
 * @fn dwt_connect_LNA()
 *
 *  @brief This is used to connect external LNA - HW dependent
 *
 * input parameters
 *
 * output parameters
 *
 * no return value
 */
void dwt_connect_LNA(void)
{
    uint8_t buf[GPIO_MODE_LEN];

    // Set the GPIO to control external LNA
    dwt_readfromdevice(GPIO_CTRL_ID, GPIO_MODE_OFFSET, GPIO_MODE_LEN, buf);

    buf[GPIO_LNA_byte_no] |= (GPIO_PIN5_EXTTXE_8 + GPIO_PIN6_EXTRXE_8);

    dwt_writetodevice(GPIO_CTRL_ID, GPIO_MODE_OFFSET, GPIO_MODE_LEN, buf);
}


/*! ------------------------------------------------------------------------------------------------------------------
 * @fn dwt_getldotune()
 *
 *  @brief This is used to return the low 32 bits of the programmed LDO tune value of the device
 *
 * input parameters
 *
 * output parameters
 *
 * returns the 32 bit LDO tune value of the device as programmed in the factory
 */
uint32_t dwt_getldotune(void)
{
	return dw1000local.ldoTune;
}

/*! ------------------------------------------------------------------------------------------------------------------
 * @fn dwt_getpartid()
 *
 *  @brief This is used to return the read part ID of the device
 *
 * input parameters
 *
 * output parameters
 *
 * returns the 32 bit part ID value as programmed in the factory
 */
uint32_t dwt_getpartid(void)
{
    return dw1000local.partID;
}

/*! ------------------------------------------------------------------------------------------------------------------
 * @fn dwt_getlotid()
 *
 *  @brief This is used to return the read lot ID of the device
 *
 * input parameters
 *
 * output parameters
 *
 * returns the 32 bit lot ID value as programmed in the factory
 */
uint32_t dwt_getlotid(void)
{
    return dw1000local.lotID;
}

/*! ------------------------------------------------------------------------------------------------------------------
 * @fn dwt_readdevid()
 *
 *  @brief This is used to return the read device tyoe and revision information of the DW1000 device (MP part is 0xDECA0130)
 *
 * input parameters:
 *
 * output parameters:
 *
 * returns the read value which for DW1000 is 0xDECA0130
 */
uint32_t dwt_readdevid(void)
{
    return dwt_read32bitoffsetreg(DEV_ID_ID,0);
}

/*! ------------------------------------------------------------------------------------------------------------------
 * @fn dwt_configuretxrf()
 *
 * @brief This function provides the API for the configuration of the TX spectrum
 * including the power and pulse generator delay. The input is a pointer to the data structure
 * of type dwt_txconfig_t that holds all the configurable items.
 *
 * input parameters
 * @param config    -   pointer to the txrf configuration structure, which contains the tx rf config data
 *
 * output parameters
 *
 * no return value
 *
 */
void dwt_configuretxrf(dwt_txconfig_t *config)
{

    //Config RF TX PG_DELAY
    dwt_writetodevice(TX_CAL_ID, TC_PGDELAY_OFFSET, 1, &config->PGdly);

    //Configure TX power
    dwt_write32bitreg(TX_POWER_ID, config->power);

}


/*! ------------------------------------------------------------------------------------------------------------------
 * @fn dwt_getotptxpower()
 *
 * @brief This API function returns the tx power value read from OTP memory as part of initialisation
 *
 * input parameters
 * @param prf   -   this is the PRF e.g. DWT_PRF_16M or DWT_PRF_64M
 * @param chan  -   this is the channel e.g. 1 to 7
 *
 * output parameters
 *
 * returns tx power value for a given PRF and channel
 */
uint32_t dwt_getotptxpower(uint8_t prf, uint8_t chan)
{
    return dw1000local.txPowCfg[(prf - DWT_PRF_16M) + (chan_idx[chan] * 2)];
}


/*! ------------------------------------------------------------------------------------------------------------------
 * @fn dwt_configure()
 *
 * @brief This function provides the main API for the configuration of the
 * DW1000 and this low-level driver.  The input is a pointer to the data structure
 * of type dwt_config_t that holds all the configurable items.
 * The dwt_config_t structure shows which ones are supported
 *
 * input parameters
 * @param config    -   pointer to the configuration structure, which contains the device configuration data.
 * @param useotp    -   specifies what configuration (read form OTP memory as part of initialisation) to configure
 *                  DWT_LOADANTDLY    0x2 - load the antenna delay values
 *                  DWT_LOADXTALTRIM  0x1 - load XTAL trim values
 *                  DWT_LOADNONE      0x0 - do not load any values from OTP memory
 *
 * output parameters
 *
 * returns DWT_DECA_SUCCESS for success, or DWT_DECA_ERROR for error
 */
int dwt_configure(dwt_config_t *config, uint8_t use_otpconfigvalues)
{
    uint8_t nsSfd_result  = 0;
    uint8_t useDWnsSFD = 0;
    uint8_t chan = config->chan ;
    uint32_t regval ;
    uint16_t reg16 = lde_replicaCoeff[config->rxCode];
    uint8_t prfIndex = dw1000local.prfIndex = config->prf - DWT_PRF_16M;
    uint8_t bw = ((chan == 4) || (chan == 7)) ? 1 : 0 ; //select wide or narrow band

    dw1000local.chan = config->chan ;

