JEB12345/dwm1000_dspic/decadriver/deca_device.c
#ifdef DWT_API_ERROR_CHECK
    if (config->dataRate > DWT_BR_6M8) return DWT_ERROR ; // validate datarate parameter
    if ((config->prf > DWT_PRF_64M) || (config->prf < DWT_PRF_16M)) return DWT_ERROR ;      // validate Pulse Repetition Frequency
    if (config->rxPAC > DWT_PAC64) return DWT_ERROR ;      // validate PAC size
    if ((chan < 1) || (chan > 7) || (6 == chan)) return DWT_ERROR ; // validate channel number parameter

    // validate TX and TX pre-amble codes selections
    if (config->prf == DWT_PRF_64M)
    {
        // at 64M PRF, codes should be 9 to 27 only
        // config->txCode
        // config->rxCode
    }
    else
    {
        // at 16M PRF, codes should be 0 to 8 only
    }
    switch (config->txPreambLength)
    {
    case DWT_PLEN_4096 :
    case DWT_PLEN_2048 :
    case DWT_PLEN_1536 :
    case DWT_PLEN_1024 :
    case DWT_PLEN_512  :
    case DWT_PLEN_256  :
    case DWT_PLEN_128  :
    case DWT_PLEN_64   : break ; // all okay
    default            : return DWT_ERROR ; // not a good preamble length parameter
    }

    if(config->phrMode > DWT_PHRMODE_EXT)
        return DWT_ERROR ;
#endif

    // for 110 kbps we need to special setup
    if(DWT_BR_110K == config->dataRate)
    {
        dw1000local.sysCFGreg |= SYS_CFG_RXM110K ;

        reg16 >>= 3;  //div by 8
    }
    else
    {
        dw1000local.sysCFGreg &= (~SYS_CFG_RXM110K) ;
    }

    dw1000local.longFrames = config->phrMode ;

    dw1000local.sysCFGreg |= (SYS_CFG_PHR_MODE_11 & (((uint32_t)config->phrMode) << 16)) ;

    dwt_write32bitreg(SYS_CFG_ID,dw1000local.sysCFGreg) ;
    //write/set the lde_replicaCoeff
    dwt_write16bitoffsetreg(LDE_IF_ID, LDE_REPC_OFFSET, reg16 ) ;

    _dwt_configlde(prfIndex);

//    config RF pll (for a given channel)
//    configure PLL2/RF PLL block CFG
    dwt_writetodevice(FS_CTRL_ID, FS_PLLCFG_OFFSET, 5, &pll2_config[chan_idx[chan]][0]);    //alliv rewrite to 32bit + 8 bit
    //configure PLL2/RF PLL block CAL
    dwt_writetodevice(FS_CTRL_ID, FS_XTALT_OFFSET, 1, &pll2calcfg);

    // Configure RF RX blocks (for specified channel/badwidth)
    dwt_writetodevice(RF_CONF_ID, RF_RXCTRLH_OFFSET, 1, &rx_config[bw]);

    // Configure RF TX blocks (for specified channel and prf)
    //Config RF TX control
    dwt_write32bitoffsetreg(RF_CONF_ID, RF_TXCTRL_OFFSET, tx_config[chan_idx[chan]]);

    // Configure the baseband parameters (for specified prf, bit rate, pac, and SFD settings)
    //DTUNE0
    dwt_write16bitoffsetreg(DRX_CONF_ID, DRX_TUNE0b_OFFSET, sftsh[config->dataRate][config->nsSFD]);

    //DTUNE1
    dwt_write16bitoffsetreg(DRX_CONF_ID, DRX_TUNE1a_OFFSET, dtune1[prfIndex]);

    if(config->dataRate == DWT_BR_110K)
    {
        dwt_write16bitoffsetreg(DRX_CONF_ID, DRX_TUNE1b_OFFSET, 0x64);
    }
    else
    {
        if(config->txPreambLength == DWT_PLEN_64) //if preamble length is 64
        {
            uint8_t temp = 0x10;
            dwt_write16bitoffsetreg(DRX_CONF_ID, DRX_TUNE1b_OFFSET, 0x10);
            dwt_writetodevice(DRX_CONF_ID, 0x26, 1, &temp);
        }
        else
        {
            uint8_t temp = 0x28;
            dwt_write16bitoffsetreg(DRX_CONF_ID, DRX_TUNE1b_OFFSET, 0x20);
            dwt_writetodevice(DRX_CONF_ID, 0x26, 1, &temp);
        }
    }

    //DTUNE2
    dwt_write32bitoffsetreg(DRX_CONF_ID, DRX_TUNE2_OFFSET, digital_bb_config[prfIndex][config->rxPAC]);

    //DTUNE3
    if(config->sfdTO != DWT_SFDTOC_DEF) { //if default value no need to program it
        dwt_write16bitoffsetreg(DRX_CONF_ID, DRX_SFDTOC_OFFSET, config->sfdTO);
    }
    //don't allow 0 - SFD timeout will always be enabled
    if(config->sfdTO == 0) {
        dwt_write16bitoffsetreg(DRX_CONF_ID, DRX_SFDTOC_OFFSET, DWT_SFDTOC_DEF);
    }
    // configure AGC parameters
    dwt_write32bitoffsetreg( AGC_CFG_STS_ID, 0xC, agc_config.lo32);
    dwt_write16bitoffsetreg( AGC_CFG_STS_ID, 0x4, agc_config.target[prfIndex]);

    // set (non-standard) user SFD for improved performance,
    if(config->nsSFD)
    {
         //Write non standard (DW) SFD length
         dwt_writetodevice(USR_SFD_ID,0x00,1,&dwnsSFDlen[config->dataRate]);
         nsSfd_result = 3 ;
         useDWnsSFD = 1 ;
    }
    regval =  (CHAN_CTRL_TX_CHAN_MASK & (((uint32_t)chan) << CHAN_CTRL_TX_CHAN_SHIFT)) |            // Transmit Channel
              (CHAN_CTRL_RX_CHAN_MASK & (((uint32_t)chan) << CHAN_CTRL_RX_CHAN_SHIFT)) |            // Receive Channel
              (CHAN_CTRL_RXFPRF_MASK & (((uint32_t)config->prf) << CHAN_CTRL_RXFPRF_SHIFT)) |     // RX PRF
              ((CHAN_CTRL_TNSSFD|CHAN_CTRL_RNSSFD) & (((uint32_t)nsSfd_result) << CHAN_CTRL_TNSSFD_SHIFT)) |       // nsSFD enable RX&TX
              (CHAN_CTRL_DWSFD & (((uint32_t)useDWnsSFD) << CHAN_CTRL_DWSFD_SHIFT)) |      // use DW nsSFD
              (CHAN_CTRL_TX_PCOD_MASK & (((uint32_t)config->txCode) << CHAN_CTRL_TX_PCOD_SHIFT)) |  // TX Preamble Code
              (CHAN_CTRL_RX_PCOD_MASK & (((uint32_t)config->rxCode) << CHAN_CTRL_RX_PCOD_SHIFT)) ;  // RX Preamble Code

    dwt_write32bitreg(CHAN_CTRL_ID,regval) ;

    // Set up TX Preamble Size and TX PRF
    // Set up TX Ranging Bit and Data Rate
    {
        uint32_t x = ((uint32_t)(config->txPreambLength | config->prf))  <<  16;
        dw1000local.txFCTRL = x | TX_FCTRL_TR |     /* always set ranging bit !!! */
                                (((uint32_t)config->dataRate) << TX_FCTRL_TXBR_SHFT) ;

        dwt_write32bitoffsetreg(TX_FCTRL_ID,0,dw1000local.txFCTRL) ;
    }

    if (use_otpconfigvalues & DWT_LOADXTALTRIM)
    {
        dwt_xtaltrim(dw1000local.xtrim);
    }

    if (use_otpconfigvalues & DWT_LOADANTDLY)
    {
        //put half of the antenna delay value into tx and half into rx
        dwt_setrxantennadelay(((dw1000local.antennaDly >> (16*prfIndex)) & 0xFFFF) >> 1);
        dwt_settxantennadelay(((dw1000local.antennaDly >> (16*prfIndex)) & 0xFFFF) >> 1);
    }

    dwt_write32bitreg(0x24,(uint32_t)0b100) ;
    
    
    return DWT_SUCCESS ;

