JEB12345/dwm1000_dspic/decadriver/deca_device.c
/*! ------------------------------------------------------------------------------------------------------------------
 * @fn dwt_setrxaftertxdelay()
 *
 *  @brief This sets the receiver turnon delay time after a transmission of a frame
 *
 * input parameters
 * @param rxDelayTime - (20 bits) - the delay is in micro seconds
 *
 * output parameters
 *
 * no return value
 */
void dwt_setrxaftertxdelay(uint32_t rxDelayTime)
{
    uint32_t val = dwt_read32bitreg(ACK_RESP_T_ID) ;          // read ACK_RESP_T_ID register

    val &= ~(ACK_RESP_T_W4R_TIM_MASK) ; //clear the timer (19:0)

    val |= (rxDelayTime & ACK_RESP_T_W4R_TIM_MASK) ; //in usec (e.g. turn the receiver 20us after TX)

    dwt_write32bitreg(ACK_RESP_T_ID, val) ;
}

/*! ------------------------------------------------------------------------------------------------------------------
 * @fn dwt_setcallbacks()
 *
 *  @brief This is the devices interrupt handler function, it will process/report status events
 *
 * input parameters
 * @param txcallback - the pointer to the TX callback function
 * @param rxcallback - the pointer to the RX callback function
 *
 * output parameters
 *
 * no return value
 */
void dwt_setcallbacks(void (*txcallback)(const dwt_callback_data_t *), void (*rxcallback)(const dwt_callback_data_t *))
{
    dw1000local.dwt_txcallback = txcallback;

    dw1000local.dwt_rxcallback = rxcallback;
}

/*! ------------------------------------------------------------------------------------------------------------------
 * @fn dwt_isr()
 *
 * @brief This is the devices interrupt handler function, it will process/report status events
 * Notes:  In PC based system using (Cheetah or ARM) USB to SPI converter there can be no interrupts, however we still need something
 *         to take the place of it and operate in a polled way.
 *         In an embedded system this function should be configured to launch on an interrupt, then it will process the interrupt trigger event and
 *         call a tx or rx callback function depending on whether the event is a TX or RX event.
 *         the tx call-back will be called when a frame has been sent and the rx call-back when a frame has been received.
 *
 * input parameters
 *
 * output parameters
 *
 * no return value
 */
#define DEBUGx 0

void dwt_isr(void) // assume interrupt can supply context
{
    volatile uint32_t  status = 0;
    uint32_t  clear = 0; // will clear any events seen
    uint32_t statusOK=0;
    
#if (DEBUGx==1)
    uint32_t status1 = 0;
    uint32_t states = 0;
    uint32_t states1 = 0;
    uint8_t buffer[2] = {0, 0};
#endif
    dw1000local.cdata.event = 0;
	dw1000local.cdata.dblbuff = dw1000local.dblbuffon ;

    status = dwt_read32bitreg(SYS_STATUS_ID) ;            // read status register low 32bits
    statusOK = status;
//    if((status&SYS_STATUS_RXDFR) || (status& SYS_STATUS_RXPHE)){
//           // statusOK = dwt_read32bitreg(SYS_STATUS_ID) ;
//        while(1){
//            #define RGB_RED     LATGbits.LATG8
//#define RGB_BLUE    LATGbits.LATG6
//#define RGB_GREEN   LATAbits.LATA0
//            RGB_RED = 1;
//            RGB_GREEN = 0;
//            RGB_BLUE = 1;
//        }
//    }

    //NOTES:
    //1. TX Event - if DWT_INT_TFRS is enabled, then when the frame has completed transmission the interrupt will be triggered.
    //   The status register will have the TXFRS bit set. This function will clear the tx event and call the dwt_txcallback function.
    //
    //2. RX Event - if DWT_INT_RFCG is enabled, then when a frame with good CRC has been received the interrupt will be triggered.
    //   The status register will have the RXFCG bit set. This function will clear the rx event and call the dwt_rxcallback function.
    //
    //2.a. RX Event - This is same as 2. above except this time the received frame has ACK request bit set in the header (AAT bit will be set).
    //     This function will clear the rx event and call the dwt_rxcallback function, notifying the application that ACK req is set.
    //     If using auto-ACK, the AAT indicates that ACK frame transmission is in progress. Once the ACK has been sent the TXFRS bit will be set and TX event triggered.
    //     If the auto-ACK is not enabled, the application can format/configure and start transmission of its own ACK frame.
    //

#if (DEBUGx==1)
    //DEBUG ----- DEBUG ----- DEBUG -----
    status1 = dwt_read32bitoffsetreg(SYS_STATUS_ID, 1) ;            // read status register
    dwt_readfromdevice(RX_BUFFER_ID,0,2,buffer) ;
    printf("status %02X%08X, byte 0 %02X%02X\n", status1>>24, status, buffer[0], buffer[1]);
    states = dwt_read32bitreg(0x19) ;            // read status register
    states1 = dwt_read32bitoffsetreg(0x19, 1) ;            // read status register
    printf("states %02X%08X\n", states1>>24, states);
#endif

	//fix for bug 622 - LDE done flag gets latched on a bad frame
	if((status & SYS_STATUS_LDEDONE) && (dw1000local.dblbuffon == 0))
	if((status & (SYS_STATUS_LDEDONE | SYS_STATUS_RXPHD | SYS_STATUS_RXSFDD)) != (SYS_STATUS_LDEDONE | SYS_STATUS_RXPHD | SYS_STATUS_RXSFDD))
	{
		
		//got LDE done but other flags SFD and PHR are clear - this is a bad frame - reset the transceiver
		dwt_forcetrxoff(); //this will clear all events
		
		dwt_rxreset();		
		//leave any TX events for processing (e.g. if we TX a frame, and then enable rx, 
		//we can get into here before the TX frame done has been processed, when we are polling (i.e. slow to process the TX)
		status &= CLEAR_ALLTX_EVENTS;
		//re-enable the receiver - if auto rx re-enable set
		if(dw1000local.sysCFGreg & SYS_CFG_RXAUTR)
		{
			dwt_write16bitoffsetreg(SYS_CTRL_ID,0,(uint16_t)SYS_CTRL_RXENAB) ;
		}
		else
		{
			dw1000local.cdata.event = DWT_SIG_RX_ERROR  ;

			if(dw1000local.dwt_rxcallback != NULL)
				dw1000local.dwt_rxcallback(&dw1000local.cdata);
		}
	}


    //
    // 1st check for RX frame received or RX timeout and if so call the rx callback function
    //
    if(status & SYS_STATUS_RXFCG) // Receiver FCS Good
		{

		if(status & SYS_STATUS_LDEDONE)  // LDE done/finished
			{ 
			// bug 634 - overrun overwrites the frame info data... so both frames should be discarded
			// read frame info and other registers and check for overflow again
			// if overflow set then discard both frames... 
				
			uint16_t len = 0;

			if (status & SYS_STATUS_RXOVRR) //NOTE when overrun both HS and RS pointers point to the same buffer
			{ 
				//when the overrun happens the frame info data of the buffer A (which contains the older frame e.g. seq. num = x) 
				//will be corrupted with the latest frame (seq. num = x + 2) data, both the host and IC are pointing to buffer A
				//we are going to discard this frame - turn off transceiver and reset receiver
				dwt_forcetrxoff();
				
				dwt_rxreset();	

				if(dw1000local.sysCFGreg & SYS_CFG_RXAUTR) //re-enable of RX is ON, then re-enable here (ignore error) 
				{ 
					dwt_write16bitoffsetreg(SYS_CTRL_ID,0,(uint16_t)SYS_CTRL_RXENAB) ;
				}
				else //the RX will be re-enabled by the application, report an error
				{
					dw1000local.cdata.event = DWT_SIG_RX_ERROR  ;

					if(dw1000local.dwt_rxcallback != NULL)
						dw1000local.dwt_rxcallback(&dw1000local.cdata);
				}

				return;
			}
			else //no overrun condition - proceed to process the frame
			{
                
		len = dwt_read16bitoffsetreg(RX_FINFO_ID, 0) & 0x3FF;
	        dwt_readfromdevice(RX_BUFFER_ID,0,2,dw1000local.cdata.fctrl) ;
	        if (dw1000local.longFrames==0)
	        {
	            len &= 0x7F ;
	        }
	
			// Standard frame length up to 127, extended frame length up to 1023 bytes
	        dw1000local.cdata.datalength = len ;
	
