JEB12345/dwm1000_dspic/decadriver/deca_device.c
	        //bug 627 workaround - clear the AAT bit if the ACK request bit in the FC is not set
	        if((status & SYS_STATUS_AAT) //AAT bit is set (ACK has been requested)
	            && (((dw1000local.cdata.fctrl[0] & 0x20) == 0) || (dw1000local.cdata.fctrl[0] == 0x02)) //but the data frame has it clear or it is an ACK frame
	            )
	        {
	            clear |= SYS_STATUS_AAT ;
	            dw1000local.cdata.aatset = 0 ; //ACK request is not set
	            dw1000local.wait4resp = 0;
	        }
	        else //the AAT is correctly set for a frame that requested the ACK
	        {
					dw1000local.cdata.aatset = (status & SYS_STATUS_AAT) ; //check if ACK request is set
	        }
	
			dw1000local.cdata.event = DWT_SIG_RX_OKAY ;

			if(dw1000local.dblbuffon == 0) //if no double buffering
			{
		        //clear all receive status bits (as we are finished with this receive event)
		        clear |= status & CLEAR_ALLRXGOOD_EVENTS  ;
		        dwt_write32bitreg(SYS_STATUS_ID,clear) ;         // write status register to clear event bits we have seen
	
		        //NOTE: clear the event which caused interrupt means once the rx is enabled or tx is started
		        //new events can trigger and give rise to new interrupts
		        //call the RX call-back function to process the RX event
		        if(dw1000local.dwt_rxcallback != NULL)
				{
		            dw1000local.dwt_rxcallback(&dw1000local.cdata);
				}
			}
			else //double buffer
	        {
				uint8_t  buff ;
	            uint8_t hsrb = 0x01 ;

				//need to make sure that the host/IC buffer pointers are aligned before starting RX
				//read again because the status could have changed since the interrupt was triggered
				dwt_readfromdevice(SYS_STATUS_ID, 3, 1, &buff);
				//if ICRBP is equal to HSRBP this means we've received another frame (both buffers have frames) 
				if((buff & (SYS_STATUS_ICRBP>>24) ) ==              /* IC side Receive Buffer Pointer */
				((buff & (SYS_STATUS_HSRBP>>24) ) << 1) )   /* Host Side Receive Buffer Pointer */			
				{
					//clear all receive status bits (as we are finished with this receive event)
					clear |= status & CLEAR_DBLBUFF_EVENTS  ;
					dwt_write32bitreg(SYS_STATUS_ID,clear) ;         // write status register to clear event bits we have seen
				}
				//if they are not aligned then there is a new frame in the other buffer, so we just need to toggle...

				if((dw1000local.sysCFGreg & SYS_CFG_RXAUTR) == 0) //double buffer is on but no auto rx re-enable RX
				{
					dwt_write16bitoffsetreg(SYS_CTRL_ID,0,(uint16_t)SYS_CTRL_RXENAB) ;
				}

				//call the RX call-back function to process the RX event
				if(dw1000local.dwt_rxcallback != NULL)
					dw1000local.dwt_rxcallback(&dw1000local.cdata);

				//if overrun, then reset the reciver - RX bug, when overruns cannot guarantee the last frame's data was not corrupted 
				//if no overrun all is good, toggle the pointer
				if(dwt_checkoverrun() == 0)
				{
	            	//toggle the host side Receive Buffer Pointer by writing one to the register
	            	dwt_writetodevice(SYS_CTRL_ID, SYS_CTRL_HRBT_OFFSET, 1, &hsrb) ;       // we need to swap rx buffer status reg (write one to toggle internally)
	        	}
				else
				{
						//the calback has completed, but the overrun has been set, before we toggled, this means two new frames have arrived (one in the other buffer) and the 2nd's PHR good set the overrun flag  
						//due to a receiver bug, which cannot guarantee the last frame's data was not corrupted need to reset receiver and discard any new data
					dwt_forcetrxoff();

					dwt_rxreset();	

					if(dw1000local.sysCFGreg & SYS_CFG_RXAUTR) //re-enable of RX is ON, then re-enable here 
					{
						dwt_write16bitoffsetreg(SYS_CTRL_ID,0,(uint16_t)SYS_CTRL_RXENAB) ;
					}
				}
			 } //end of else double buffer

			}//end of no overrun 
		} //if LDE_DONE is set (this means we have both SYS_STATUS_RXFCG and SYS_STATUS_LDEDONE)
		else //no LDE_DONE ? 
		{
			//printf("NO LDE done or LDE error\n");
		}
    } // end if CRC is good
    else
    //
    // Check for TX frame sent event and signal to upper layer.
    //
    if (status & SYS_STATUS_TXFRS)  // Transmit Frame Sent
    {
        clear |= CLEAR_ALLTX_EVENTS; //clear TX event bits
        dwt_write32bitreg(SYS_STATUS_ID,clear) ;         // write status register to clear event bits we have seen
        //NOTE: clear the event which caused interrupt means once the rx is enabled or tx is started
        //new events can trigger and give rise to new interrupts
        if(dw1000local.cdata.aatset)
        {
            dw1000local.cdata.aatset = 0; //the ACK has been sent
            if(dw1000local.dblbuffon == 0) //if not double buffered
            {
            	if(dw1000local.wait4resp) //wait4response was set with the last TX start command
            	{
            		//if using wait4response and the ACK has been sent as the response requested it
            		//the receiver will be re-enabled, so issue a TRXOFF command to disable and prevent any
            		//unexpected interrupts
            		dwt_forcetrxoff();
            	}
            }
        }

        dw1000local.cdata.event = DWT_SIG_TX_DONE ;  // signal TX completed

        //call the TX call-back function to process the TX event
        if(dw1000local.dwt_txcallback != NULL)
            dw1000local.dwt_txcallback(&dw1000local.cdata);

    }
    else if (status & SYS_STATUS_RXRFTO)                                              // Receiver Frame Wait timeout:
    {
        clear |= status & SYS_STATUS_RXRFTO ;
        dwt_write32bitreg(SYS_STATUS_ID,clear) ;         // write status register to clear event bits we have seen
        dw1000local.cdata.event = DWT_SIG_RX_TIMEOUT  ;
        if(dw1000local.dwt_rxcallback != NULL)
            dw1000local.dwt_rxcallback(&dw1000local.cdata);
        dw1000local.wait4resp = 0;

