JEB12345/dwm1000_dspic/decadriver/deca_device.c
/*! ------------------------------------------------------------------------------------------------------------------
 * @fn dwt_starttx()
 *
 *  @brief This call initiates the transmission, input parameter indicates which TX mode is used see below
 *
 * input parameters:
 * @param mode - if 0 immediate TX (no response expected)
 *               if 1 delayed TX (no response expected)
 *               if 2 immediate TX (response expected - so the receiver will be automatically turned on after TX is done)
 *               if 3 delayed TX (response expected - so the receiver will be automatically turned on after TX is done)
 *
 * output parameters
 *
 * returns DWT_DECA_SUCCESS for success, or DWT_DECA_ERROR for error (e.g. a delayed transmission will fail if the delayed time has passed)
 */
#pragma GCC optimize ("O3")
int dwt_starttx(uint8_t mode)
{
    int retval = DWT_SUCCESS ;
    uint8_t temp  = 0x00;

    if(mode & DWT_RESPONSE_EXPECTED)
    {
        temp = (uint8_t)SYS_CTRL_WAIT4RESP ; //set wait4response bit
        dw1000local.wait4resp = 1;
    }

    if (mode & DWT_START_TX_DELAYED)
    {
        //uint32_t status ;

        // both SYS_CTRL_TXSTRT and SYS_CTRL_TXDLYS to correctly enable TX
        temp |= (uint8_t)(SYS_CTRL_TXDLYS | SYS_CTRL_TXSTRT) ;
        dwt_writetodevice(SYS_CTRL_ID,0,1,&temp) ;
        dwt_readfromdevice(SYS_STATUS_ID,3,1,&temp) ;
        //status = dwt_read32bitreg(SYS_STATUS_ID) ;          // read status register
        if ((temp & ((SYS_STATUS_HPDWARN >> 24) /*| SYS_STATUS_TXPRERR*/)) == 0)                               // Transmit Delayed Send set over Half a Period away.
        {
            //printf("tx delayed \n");
            retval = DWT_SUCCESS ;                                          // All okay
        }
        else
        {
            // I am taking DSHP set to Indicate that the TXDLYS was set too late for the specified DX_TIME.
            // Remedial Action - (a) cancel delayed send
            temp = (uint8_t)SYS_CTRL_TRXOFF;                                  // this assumes the bit is in the lowest byte
            dwt_writetodevice(SYS_CTRL_ID,0,1,&temp) ;
            // note event Delayed TX Time too Late
            // could fall through to start a normal send (below) just sending late.....
            // ... instead return and assume return value of 1 will be used to detect and recover from the issue.

            // clear the "auto TX to sleep" bit
            dwt_entersleepaftertx(0);
            dw1000local.wait4resp = 0;
            retval = DWT_ERROR ;                                            // Failed !

        }
    }
    else
    {
        temp |= (uint8_t)SYS_CTRL_TXSTRT ;
        dwt_writetodevice(SYS_CTRL_ID,0,1,&temp) ;
    }

    return retval;

} // end dwt_starttx()

// -------------------------------------------------------------------------------------------------------------------
//
// Clear overrun condition 
//
int dwt_checkoverrun(void)
{
	return (dwt_read16bitoffsetreg(SYS_STATUS_ID, 2) & (SYS_STATUS_RXOVRR >> 16));
}

// -------------------------------------------------------------------------------------------------------------------
//
// Force Transceiver OFF
//
#pragma GCC optimize ("O3")
void dwt_forcetrxoff(void)
{
	decaIrqStatus_t stat ;
    uint8_t temp ;
	uint32_t mask;

    temp = (uint8_t)SYS_CTRL_TRXOFF ;                       // this assumes the bit is in the lowest byte
	
	mask = dwt_read32bitreg(SYS_MASK_ID) ;  //read set interrupt mask

	// need to beware of interrupts occurring in the middle of following read modify write cycle
	// we can disable the radio, but before the status is cleared an interrupt can be set (e.g. the 
	// event has just happened before the radio was disabled)
	// thus we need to disable interrupt during this operation
    stat = decamutexon() ;

	dwt_write32bitreg(SYS_MASK_ID, 0) ; //clear interrupt mask - so we don't get any unwanted events

    dwt_writetodevice(SYS_CTRL_ID,0,1,&temp) ; //disable the radio

    // Forcing Transceiver off - so we do not want to see any new events that may have happened
    dwt_write32bitreg(SYS_STATUS_ID,(CLEAR_ALLTX_EVENTS | CLEAR_ALLRXERROR_EVENTS | CLEAR_ALLRXGOOD_EVENTS)) ;

    dwt_syncrxbufptrs();

	dwt_write32bitreg(SYS_MASK_ID, mask) ; //set interrupt mask to what it was

	//enable/restore interrupts again... 
	decamutexoff(stat) ;
    dw1000local.wait4resp = 0;

} // end deviceforcetrxoff()

/*! ------------------------------------------------------------------------------------------------------------------
 * @fn dwt_syncrxbufptrs()
 *
 *  @brief this function synchronizes rx buffer pointers
 *  need to make sure that the host/IC buffer pointers are aligned before starting RX
 *
 * input parameters:
 *
 * output parameters
 *
 * no return value
 */
void dwt_syncrxbufptrs(void)
{
    uint8_t  buff ;
    //need to make sure that the host/IC buffer pointers are aligned before starting RX
    dwt_readfromdevice(SYS_STATUS_ID, 3, 1, &buff);

    if((buff & (SYS_STATUS_ICRBP>>24) ) !=              /* IC side Receive Buffer Pointer */
            ((buff & (SYS_STATUS_HSRBP>>24) ) << 1) )   /* Host Side Receive Buffer Pointer */
    {
        uint8_t hsrb = 0x01;
        dwt_writetodevice(SYS_CTRL_ID, SYS_CTRL_HRBT_OFFSET , 1, &hsrb) ;       // we need to swap rx buffer status reg (write one to toggle internally)
    }
}

/*! ------------------------------------------------------------------------------------------------------------------
 * @fn dwt_setrxmode()
 *
 *  @brief enable different rx modes, e.g.:
 *   a) "snooze" mode, the receiver only listens periodically for preamble
 *   b) the rx PPDM "sniff" mode - receiver cycles through ON/OFF periods
 *
 * input parameters:
 * @param mode      - DWT_RX_NORMAL = 0x0
 *                    DWT_RX_SNIFF  = 0x1      enable the rx PPDM "sniff" mode
 * @param rxON      - SNIFF mode ON period in PACs
 * @param rxOFF     - SNIFF mode OFF period in us (actually in 1.0256 micro second intervals)
 * output parameters
 *
 * no return value
 */
void dwt_setrxmode(int mode, uint8_t rxON, uint8_t rxOFF)
{
    uint16_t reg16 =  RX_SNIFF_MASK & ((rxOFF << 8) | rxON);

