JEB12345/dwm1000_dspic/decadriver/deca_device.c
/*! ------------------------------------------------------------------------------------------------------------------
 * @fn dwt_configcontinuousframemode()
 *
 *  @brief this function sets the DW1000 to continuous tx frame mode
 *
 * input parameters:
 * @param framerepetitionrate - specifies the
 *
 * output parameters
 *
 * no return value
 */
void dwt_configcontinuousframemode(uint32_t framerepetitionrate)
{
    uint8_t write_buf[4];
    //
    //  disable TX/RX RF block sequencing (needed for continuous frame mode)
    //

    _dwt_disablesequencing();

    // enable RF PLL and TX blocks
    //
    dwt_write32bitreg(RF_CONF_ID, RF_CONF_TXPLLPOWEN_MASK);   //enable LDO and RF PLL blocks
    dwt_write32bitreg(RF_CONF_ID, RF_CONF_TXALLEN_MASK);   //enable the rest of TX blocks

    //
    //  configure TX clocks
    //
    _dwt_enableclocks(FORCE_SYS_PLL);
    _dwt_enableclocks(FORCE_TX_PLL);

    //set the frame repetition rate
    if(framerepetitionrate < 4)
        framerepetitionrate = 4;

    dwt_write32bitoffsetreg(DX_TIME_ID, 0, framerepetitionrate) ;
    //
    //  configure continuous frame TX
    //
    write_buf[0] = (uint8_t)(DIAG_TMC_TX_PSTM) ;
    dwt_writetodevice(DIG_DIAG_ID, DIAG_TMC_OFFSET, 1,write_buf); //turn the tx power spectrum test mode - continuous sending of frames
}

/*! ------------------------------------------------------------------------------------------------------------------
 * @fn dwt_readtempvbat()
 *
 *  @brief this function reads the battery voltage and temperature of the MP
 *  The values read here will be the current values sampled by DW1000 AtoD converters.
 *  Note on Temperature: the temperature value needs to be converted to give the real temperature
 *  the formula is: 1.13 * reading - 113.0
 *  Note on Voltage: the voltage value needs to be converted to give the real voltage
 *  the formula is: 0.0057 * reading + 2.3
 *
 *  NB: To correctly read the temperature this read should be done with xtal clock
 *  however that means that the receiver will be switched off, if receiver needs to be on then
 *  the timer is used to make sure the value is stable before reading
 *
 * input parameters:
 * @param fastSPI - set to 1 if SPI rate > than 3MHz is used
 *
 * output parameters
 *
 * returns  (temp_raw<<8)|(vbat_raw)
 */
uint16_t dwt_readtempvbat(uint8_t fastSPI)
{
    uint8_t wr_buf[2];
    uint8_t vbat_raw;
    uint8_t temp_raw;

	
    //these writes should be single writes and in sequence
    wr_buf[0] = 0x80; // Enable TLD Bias
    dwt_writetodevice(RF_CONF_ID,0x11,1,wr_buf);

    wr_buf[0] = 0x0A; // Enable TLD Bias and ADC Bias
    dwt_writetodevice(RF_CONF_ID,0x12,1,wr_buf);

    wr_buf[0] = 0x0f; // Enable Outputs (only after Biases are up and running)
    dwt_writetodevice(RF_CONF_ID,0x12,1,wr_buf);    //


    // Reading All SAR inputs
    wr_buf[0] = 0x00; //
    dwt_writetodevice(TX_CAL_ID, TC_SARL_SAR_C,1,wr_buf);
    wr_buf[0] = 0x01; // Set SAR enable
    dwt_writetodevice(TX_CAL_ID, TC_SARL_SAR_C,1,wr_buf);

    if(fastSPI == 1)
    {
    	Sleep(1); //if using PLL clocks(and fast SPI rate) then this Sleep is needed
    	//read voltage and temperature.
		dwt_readfromdevice(TX_CAL_ID, TC_SARL_SAR_LVBAT_OFFSET,2,wr_buf);
    }
    else //change to a slow clock
    {
        _dwt_enableclocks(FORCE_SYS_XTI); //NOTE: set system clock to XTI - this is necessary to make sure the values read are reliable
    	//read voltage and temperature.
   		dwt_readfromdevice(TX_CAL_ID, TC_SARL_SAR_LVBAT_OFFSET,2,wr_buf);
        //default clocks (ENABLE_ALL_SEQ)
        _dwt_enableclocks(ENABLE_ALL_SEQ); //enable clocks for sequencing
    }

	vbat_raw = wr_buf[0];
	temp_raw = wr_buf[1];

    wr_buf[0] = 0x00; // Clear SAR enable
    dwt_writetodevice(TX_CAL_ID, TC_SARL_SAR_C,1,wr_buf);

    return ((temp_raw<<8)|(vbat_raw));
}

/*! ------------------------------------------------------------------------------------------------------------------
 * @fn dwt_readwakeuptemp()
 *
 *  @brief this function reads the temperature of the DW1000 that was sampled
 *  on waking from Sleep/Deepsleep. They are not current values, but read on last
 *  wakeup if DWT_TANDV bit is set in mode parameter of dwt_configuresleep
 *
 * input parameters:
 *
 * output parameters:
 *
 * returns: 8-bit raw temperature sensor value
 */

uint8_t dwt_readwakeuptemp(void)
{
    uint8_t temp_raw;
    dwt_readfromdevice(TX_CAL_ID,TC_SARL_SAR_LTEMP_OFFSET,1,&temp_raw);
    return (temp_raw);
}


/*! ------------------------------------------------------------------------------------------------------------------
 *  @fn dwt_readwakeupvbat()
 *
 *  @brief this function reads the battery voltage of the DW1000 that was sampled
 *  on waking from Sleep/Deepsleep. They are not current values, but read on last
 *  wakeup if DWT_TANDV bit is set in mode parameter of dwt_configuresleep
 *
 * input parameters:
 *
 * output parameters:
 *
 * returns: 8-bit raw battery voltage sensor value
 */

uint8_t dwt_readwakeupvbat(void)
{
    uint8_t vbat_raw;
    dwt_readfromdevice(TX_CAL_ID,TC_SARL_SAR_LVBAT_OFFSET,1,&vbat_raw);
    return (vbat_raw);
}


/*! ------------------------------------------------------------------------------------------------------------------
*/

#if (REG_DUMP == 1)
void dwt_dumpregisters(char *str, size_t strSize)
{
    uint32_t reg = 0;
    uint8_t buff[5];
    int i;
    int cnt ;

    //first print all single registers
    for(i=0; i<0x3F; i++)
    {
        dwt_readfromdevice(i, 0, 5, buff) ;
        str += cnt = sprintf_s(str,strSize,"reg[%02X]=%02X%02X%02X%02X%02X",i,buff[4], buff[3], buff[2], buff[1], buff[0] ) ;
        strSize -= cnt ;
        str += cnt = sprintf_s(str,strSize,"\n") ;
        strSize -= cnt ;
    }

    //reg 0x20
    for(i=0; i<=32; i+=4)
    {
        reg = dwt_read32bitoffsetreg(0x20,i) ;
        str += cnt = sprintf_s(str,strSize,"reg[%02X:%02X]=%08X",0x20,i,reg) ;
        strSize -= cnt ;
        str += cnt = sprintf_s(str,strSize,"\n") ;
        strSize -= cnt ;
    }

    //reg 0x21
    for(i=0; i<=44; i+=4)
    {
        reg = dwt_read32bitoffsetreg(0x21,i) ;
        str += cnt = sprintf_s(str,strSize,"reg[%02X:%02X]=%08X",0x21,i,reg) ;
        strSize -= cnt ;
        str += cnt = sprintf_s(str,strSize,"\n") ;
        strSize -= cnt ;
    }

    //reg 0x23
    for(i=0; i<=0x20; i+=4)
    {
        reg = dwt_read32bitoffsetreg(0x23,i) ;
        str += cnt = sprintf_s(str,strSize,"reg[%02X:%02X]=%08X",0x23,i,reg) ;
        strSize -= cnt ;
        str += cnt = sprintf_s(str,strSize,"\n") ;
        strSize -= cnt ;
    }

    //reg 0x24
    for(i=0; i<=12; i+=4)
    {
        reg = dwt_read32bitoffsetreg(0x24,i) ;
        str += cnt = sprintf_s(str,strSize,"reg[%02X:%02X]=%08X",0x24,i,reg) ;
        strSize -= cnt ;
        str += cnt = sprintf_s(str,strSize,"\n") ;
        strSize -= cnt ;
    }

    //reg 0x27
    for(i=0; i<=44; i+=4)
    {
        reg = dwt_read32bitoffsetreg(0x27,i) ;
        str += cnt = sprintf_s(str,strSize,"reg[%02X:%02X]=%08X",0x27,i,reg) ;
        strSize -= cnt ;
        str += cnt = sprintf_s(str,strSize,"\n") ;
        strSize -= cnt ;
    }

    //reg 0x28
    for(i=0; i<=64; i+=4)
    {
        reg = dwt_read32bitoffsetreg(0x28,i) ;
        str += cnt = sprintf_s(str,strSize,"reg[%02X:%02X]=%08X",0x28,i,reg) ;
        strSize -= cnt ;
        str += cnt = sprintf_s(str,strSize,"\n") ;
        strSize -= cnt ;
    }

    //reg 0x2A
    for(i=0; i<20; i+=4)
    {
        reg = dwt_read32bitoffsetreg(0x2A,i) ;
        str += cnt = sprintf_s(str,strSize,"reg[%02X:%02X]=%08X",0x2A,i,reg) ;
        strSize -= cnt ;
        str += cnt = sprintf_s(str,strSize,"\n") ;
        strSize -= cnt ;
    }

