JEB12345/dwm1000_dspic/decadriver/deca_device.c
    //reg 0x2B
    for(i=0; i<24; i+=4)
    {
        reg = dwt_read32bitoffsetreg(0x2B,i) ;
        str += cnt = sprintf_s(str,strSize,"reg[%02X:%02X]=%08X",0x2B,i,reg) ;
        strSize -= cnt ;
        str += cnt = sprintf_s(str,strSize,"\n") ;
        strSize -= cnt ;
    }

    //reg 0x2f
    for(i=0; i<40; i+=4)
    {
        reg = dwt_read32bitoffsetreg(0x2f,i) ;
        str += cnt = sprintf_s(str,strSize,"reg[%02X:%02X]=%08X",0x2f,i,reg) ;
        strSize -= cnt ;
        str += cnt = sprintf_s(str,strSize,"\n") ;
        strSize -= cnt ;
    }

    //reg 0x31
    for(i=0; i<84; i+=4)
    {
        reg = dwt_read32bitoffsetreg(0x31,i) ;
        str += cnt = sprintf_s(str,strSize,"reg[%02X:%02X]=%08X",0x31,i,reg) ;
        strSize -= cnt ;
        str += cnt = sprintf_s(str,strSize,"\n") ;
        strSize -= cnt ;
    }

    //reg 0x36 = PMSC_ID
    for(i=0; i<=48; i+=4)
    {
        reg = dwt_read32bitoffsetreg(PMSC_ID,i) ;
        str += cnt = sprintf_s(str,strSize,"reg[%02X:%02X]=%08X",PMSC_ID,i,reg) ;
        strSize -= cnt ;
        str += cnt = sprintf_s(str,strSize,"\n") ;
        strSize -= cnt ;
    }
}
#endif

/* ===============================================================================================
   List of expected (known) device ID handled by this software
   ===============================================================================================

    0xDECA0130                               // DW1000 - MP

   ===============================================================================================
*/

